README.org

#+TITLE: Asuran
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:http://thomasf.github.io/solarized-css/org-info.min.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-dark.min.css" />
* Overview
  Asuran is a new archive format, and an implementation (in rust) of both a read/write library as
  well as a command line tool.
* Features Overview
** Deduplication
   Deduplication is achieved through a combination of content defined slicing and content
   addressable storage. The CAS backend will only store each chunk submitted to it once. The content
   defined slicing provides a reasonable assurance that objects will be broken up into chunks in
   shuch a way that duplicate chunks will occur, if possible, and not be stored twice.
** Encryption
   The encryption backend is plugable and can be changed on a chunk-by-chunk basis. Changing the
   default encryption will only change the encryption method for new chunks.
   
   Each chunk is encrypted and then put in an Object along side a tag indicating the encryption
   algorithm used, as well as the IV if the algorithm requires one.
*** TODO Supported Encryption types
    The supported encryption types are as follows. All types are authenticated with an HMAC tag,
    whether or not the algorithm includes authentication.

    1. [X] No Encryption (Passthrough cipher)
    2. [X] AES256-CBC
    3. [X] AES256-CTR
    4. [X] AES256-GCM
    5. [ ] chacha20-poly1305
    6. [ ] Twofish
    7. [ ] Serpent
** Compression
   The compression backend is pluggable and supports a variety of compression
   algorithms. Compression takes place before encryption, and each chunk is tagged with the
   compression algorithm used to compress it[fn:4].
*** TODO Supported Compression types
    Supported Compression types are as follows
    
    1. [X] No Compression
    2. [X] ZStd
    3. [ ] Zlib
    4. [ ] LZO
    5. [ ] LZ4
    6. [ ] BZip
    7. [ ] LZMA
** Authentication
   All data in the repository accessible through the manifest is authenticated using an HMAC
   mechanism, where items are pointed to through their HMAC, which is verified upon retrieval.
   
   In addition, each chunk is HMACed after encryption, and this seperate HMAC is verified before the
   decryption happens. The HMACs should use two seperate keys, but currently do not.

   Blake2b is currently the default HMAC algorithm, as it is far faster in software than most of the
   competition, and provides a quite reasonable assurance of security.
*** TODO Supported Hashes for HMAC
    The supported HMAC algorithms are as follows

    1. [X] SHA256
    2. [X] Blake2b
    3. [ ] SHA3
    4. [ ] Blake2s
    5. [ ] Whirlpool
    6. [ ] MD6
* Internals Overview
** Repository
   The repository is a low level key-value store that is commited to disk. All values (refered to
   as "chunks") in the repository are encrypted, compressed, and HMACed with algorithms
   configurable on a per-value basis.

   The repository only understands keys and values, and effectively operates as content addressable
   storage, all other data structures are implemented on top of the repository.

   The repository structure itself is storage-independent. The repository object itself simply views
   the world as list of segments, which themselves are lists of sized cells containing values.

   Repositories are not strictly required to have multiple segments, and segments are not strictly
   required to contain multiple chunks. This allows simple mapping of any random access storage as
   (possibly) a single segment, or an object type store (such as S3) as a number of segments each
   containing one or many chunks.

   The repository has special methods for pulling the manifest and index out of itself, and it may
   or may not treat these pieces of data as special, depending on the backend implementation in
   use. Typically, the manifest will be stored as a normal Chunk with a special key that is all
   zero.
*** Chunks
    A chunk is the representation of a value in the repository.

    It is a compressed and encrypted sequence of bytes, along with a set of tags describing the
    encryption, compression, and HMAC algorithms used, as well as any IVs those algorithms require.

    Chunks contain two HMAC values, id and hmac.

    Compression and encryption are swappable on a per chunk basis.
**** TODO ID
     The ID of the Chunk is the HMAC of its plain text content, ideally using a different key than
     hmac, but currently uses the same key. (Will be changed in a future version).
     
     ID is used for deduplication, and is the key used to reference the chunk in the repository.
**** HMAC
     The HMAC of the chunk is, as the name implies, an HMAC of the chunk's encrypted contents. This
     is used for authentication and data integrity verification.
*** Repository Backend
    The repository backend is responsible for translating the repository's "list of lists"
    segment/chunk view onto whatever storage backend is desired.  The backend is additionally
    responsible for providing a map from keys to (Segment, Offset) pairs.

    Segments are stored as the concatenation of the bytes making up the MessagePack representation
    of their chunks.

    As long as the methods return what they should, Asuran places no restrictions on how the
    underlying mapping occurs, or what side effects the methods should perform.
    
    These methods are extremely likely to be side effect prone in any implementation, and,
    generally, should not be called directly by the consumer, and instead used indirectly through
    the repository API.
**** Filesystem Backend
     The filesystem back end uses a configurable segment size[fn:1], storing segments in folders
     with a configurable limit on the number of segments in a folder[fn:2] (to avoid filesystem
     operations bogging down).
** Manifest
   The manifest is the root of the repository's object graph, and is the primary object through
   which repository access is managed.
   
   The manifest contains a list of reference to Archive objects within the repository, as well as
   methods for managing them. The manifest also contains utility methods, that when paired with a
   Target driver, can be used to backup objects to and restore objects from a repository.

   The manifest additionally contains a timestamp of its last modification, as well as the ability
   to load and commit itself from/to the repository.
