README.md

# Table of Contents

1.  [Overview](#orgd22a68e)
2.  [Features Overview](#orga27a528)
    1.  [Deduplication](#org07a85f3)
    2.  [Encryption](#org076d007)
        1.  [Supported Encryption types](#orgfb6b9b2)
    3.  [Compression](#org343e7be)
        1.  [Supported Compression types](#orgba7a655)
    4.  [Authentication](#org769855c)
        1.  [Supported Hashes for HMAC](#org0a5ccbe)
3.  [Internals Overview](#orgeedd454)
    1.  [Repository](#orga453334)
        1.  [Chunks](#org9cd377b)
        2.  [Repository Backend](#org9fa3fda)
    2.  [Manifest](#org36a93e8)
        1.  [Archive](#org1bb49d9)
        2.  [Targets](#orgd1a048b)
        3.  [Target Drivers](#org708e8ca)
    3.  [Chunker](#org6383f14)
        1.  [BuzHash](#org81447f6)
        2.  [Static Size](#org85b9af9)
        3.  [Disk Image Chunker](#orgb82d179)
4.  [Development Process](#orgf290e68)
    1.  [Roadmap](#org03301a4)
        1.  [0.1.0](#orgba9f787)
        2.  [0.2.0](#org84c91f3)
5.  [Inspiration/Motivation](#org592b002)
    1.  [Features Borg has that Restic is missing](#orgb5b82cd)
    2.  [Features Restic has that Borg is missing](#orge1e02db)
    3.  [Features I want that neither has](#org09d5d75)



<a id="orgd22a68e"></a>

# Overview

Asuran is a new archive format, and an implementation (in rust) of both a read/write library as
well as a command line tool.


<a id="orga27a528"></a>

# Features Overview


<a id="org07a85f3"></a>

## Deduplication

Deduplication is achieved through a combination of content defined slicing and content
addressable storage. The CAS backend will only store each chunk submitted to it once. The content
defined slicing provides a reasonable assurance that objects will be broken up into chunks in
shuch a way that duplicate chunks will occur, if possible, and not be stored twice.


<a id="org076d007"></a>

## Encryption

The encryption backend is plugable and can be changed on a chunk-by-chunk basis. Changing the
default encryption will only change the encryption method for new chunks.

Each chunk is encrypted and then put in an Object along side a tag indicating the encryption
algorithm used, as well as the IV if the algorithm requires one.


<a id="orgfb6b9b2"></a>

### TODO Supported Encryption types

The supported encryption types are as follows. All types are authenticated with an HMAC tag,
whether or not the algorithm includes authentication.

1.  [X] No Encryption (Passthrough cipher)
2.  [X] AES256-CBC
3.  [X] AES256-CTR
4.  [X] AES256-GCM
5.  [ ] chacha20-poly1305
6.  [ ] Twofish
7.  [ ] Serpent


<a id="org343e7be"></a>

## Compression

The compression backend is pluggable and supports a variety of compression
algorithms. Compression takes place before encryption, and each chunk is tagged with the
compression algorithm used to compress it<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.


<a id="orgba7a655"></a>

### TODO Supported Compression types

Supported Compression types are as follows

1.  [X] No Compression
2.  [X] ZStd
3.  [ ] Zlib
4.  [ ] LZO
5.  [ ] LZ4
6.  [ ] BZip
7.  [ ] LZMA


<a id="org769855c"></a>

## Authentication

All data in the repository accessible through the manifest is authenticated using an HMAC
mechanism, where items are pointed to through their HMAC, which is verified upon retrieval.

In addition, each chunk is HMACed after encryption, and this seperate HMAC is verified before the
decryption happens. The HMACs should use two seperate keys, but currently do not.

Blake2b is currently the default HMAC algorithm, as it is far faster in software than most of the
competition, and provides a quite reasonable assurance of security.


<a id="org0a5ccbe"></a>

### TODO Supported Hashes for HMAC

The supported HMAC algorithms are as follows

1.  [X] SHA256
2.  [X] Blake2b
3.  [ ] SHA3
4.  [ ] Blake2s
5.  [ ] Whirlpool
6.  [ ] MD6


<a id="orgeedd454"></a>

# Internals Overview


<a id="orga453334"></a>

## Repository

The repository is a low level key-value store that is commited to disk. All values (refered to
as "chunks") in the repository are encrypted, compressed, and HMACed with algorithms
configurable on a per-value basis.

The repository only understands keys and values, and effectively operates as content addressable
storage, all other data structures are implemented on top of the repository.

The repository structure itself is storage-independent. The repository object itself simply views
the world as list of segments, which themselves are lists of sized cells containing values.

Repositories are not strictly required to have multiple segments, and segments are not strictly
required to contain multiple chunks. This allows simple mapping of any random access storage as
(possibly) a single segment, or an object type store (such as S3) as a number of segments each
containing one or many chunks.

The repository has special methods for pulling the manifest and index out of itself, and it may
or may not treat these pieces of data as special, depending on the backend implementation in
use. Typically, the manifest will be stored as a normal Chunk with a special key that is all
zero.


<a id="org9cd377b"></a>

### Chunks

A chunk is the representation of a value in the repository.

It is a compressed and encrypted sequence of bytes, along with a set of tags describing the
encryption, compression, and HMAC algorithms used, as well as any IVs those algorithms require.

Chunks contain two HMAC values, id and hmac.

Compression and encryption are swappable on a per chunk basis.

1.  TODO ID

    The ID of the Chunk is the HMAC of its plain text content, ideally using a different key than
    hmac, but currently uses the same key. (Will be changed in a future version).
    
    ID is used for deduplication, and is the key used to reference the chunk in the repository.

2.  HMAC

    The HMAC of the chunk is, as the name implies, an HMAC of the chunk's encrypted contents. This
    is used for authentication and data integrity verification.


<a id="org9fa3fda"></a>

### Repository Backend

The repository backend is responsible for translating the repository's "list of lists"
segment/chunk view onto whatever storage backend is desired.  The backend is additionally
responsible for providing a map from keys to (Segment, Offset) pairs.

Segments are stored as the concatenation of the bytes making up the MessagePack representation
of their chunks.

As long as the methods return what they should, Asuran places no restrictions on how the
underlying mapping occurs, or what side effects the methods should perform.

These methods are extremely likely to be side effect prone in any implementation, and,
generally, should not be called directly by the consumer, and instead used indirectly through
the repository API.

1.  Filesystem Backend

    The filesystem back end uses a configurable segment size<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>, storing segments in folders
    with a configurable limit on the number of segments in a folder<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> (to avoid filesystem
    operations bogging down).


<a id="org36a93e8"></a>

## Manifest

The manifest is the root of the repository's object graph, and is the primary object through
which repository access is managed.

The manifest contains a list of reference to Archive objects within the repository, as well as
methods for managing them. The manifest also contains utility methods, that when paired with a
Target driver, can be used to backup objects to and restore objects from a repository.

The manifest additionally contains a timestamp of its last modification, as well as the ability
to load and commit itself from/to the repository.
