README.org
*** Archive
    An archive is conceptually a collection of objects stored in a repository.  This is the most
    common entry and exit point for data.

    An archive object contains a name[fn:3], a list of the objects in the archive (stored as a
    HashMap mapping the path of the object to a list of its chunks and the offsets of the chunk
    within the object), as well as the timestamp of the archive's creation.

    The timestamp is primarily intended to prevent replay attacks, but also serves to provide the
    user with additional information, as well as allowing the user to distinguish multiple archives
    with identical names.

    Object paths are unix-path style "/" delimited lists of tokens, and while they usually will map
    directly to paths, they are not required to, thus the individual tokens are allowed to contain
    any unicode character except "/".  The interpretation of the paths is left up to the target
    driver.

    Archives are commited to a manifest by MessagePacking them and storing the result as a Chunk in
    the repository. The resulting ID is then wrapped in a Stored Archive object alongside the
    metadata (name, creation date, etc...), and the StoredArchive is then added to the manifest
    list.
**** Namespaces
     Archives are namespaced, allowing multiple objects with the same path to be contained in the
     same archive, so long as they are in different namespaces.
     
     Namespaces are described as colon delimited lists of tokens with a trailing colon, in order of
     increasing specificity (e.g. 1:2: would describe a namspace named "2" inside of a namespace
     named "1").

     The complete path of a specific object in a repository is described by appending the path of
     the object to its namespace string. For example, a file "/usr/share/example" stored in the root
     namespace of an archive would be referenced by the string ":/usr/share/example", where as the
     file's metadata might be referenced by "metadata:/usr/share/example", and auditing information
     might be referenced by "metadata:audit:/user/share/example".
*** Targets
    Targets abstract the operation of creating and restoring archive to/from various types of
    storage. The API is written primarily to cater to the typical "files stored on a filesystem" use
    case, but is by no means limited to it.

    As long as the target storage has objects, that can be serialized into a byte stream, and the
    "location" of those objects can be mapped to unix path style strings, then a valid target
    implementation can be written for the storage.
**** BackupTarget and RestoreTarget
     BackupTarget and RestoreTarget are the traits that targets must be able to implement in order
     to backup data to and restore data from an archive, respectively. Most, if not all, targets will
     implement both traits.
***** BackupTarget
      BackupTarget contains the following methods:
      1. Paths
	 Returns a list of objects to be stored, as well as their paths
      2. Object
	 Returns a reader for the object given its path (from the Paths method)
      3. Listing
	 Returns a serialized listing of all the objects stored. Typically
	 stored in the archive at "archive:listing"
***** RestoreTarget
      RestoreTarget contains the following methods:
      1. Load listing
	 Parses the listing produced by BackupTarget::Paths
      2. Object
	 Returns a writer to the object's real location on the storage
      3. Listing
	 Provides a list of all paths to be restore.
**** TODO Sparse Data
     The target API is written to support the concept of sparse data, but currently no targets
     actually have support for sparse data.

     Once complete, dense data will just be handled as the degenerate case of sparse data that has
     only one contiguous chunk. This will be implemented through describing BackupObjects and
     RestoreObjects as lists of pre-seeked readers and writers, and dense data will simply be the
     case where those lists only have one element.
*** TODO Target Drivers
    The target driver trait specifies a collection of methods for writing objects to and reading
    objects from storage. The driver should handle the process of reading and writing the objects in
    their entirety, with the consumer only having to supply the repository, the archive, the root
    path to restore relative too, and the target object path.
** Chunker
   The chunker is responsible for dividing objects into chunks of bytes, using some well-defined
   method.

   The chunker framework is pluggable, and while support is planned for several chunkers, both
   special and general purpose, is planned, currently Asuran only implements one, a content defined
   chunker based on the BuzHash algorithm.
*** BuzHash
    The buzhash chunker used a modification of the buzhash rolling hash algorithm to perform content
    defined slicing.

    It runs a rolling hash down the data, and slices it when the last /n/ bits of the hash are 0, as
    long as other requirements are met.

    This chunker has three settings:
    1. Window Size
       Adjusts the sizof the data window considered by the rolling hash
    2. Mask Bits
       How many bits of the hash have to be 0 to determine a slice.

       With a Mask Bits value of /n/, the chunker will not split the data if it would result in a
       chunk less than 2^{/n/ - 2} bytes in size, and will always split the data if the chunk is
       about to exceed 2^{/n/ + 2} in size
    3. Nonce 
       This implementation randomizes the buzhash table to help prevent chunk size based
       fingerprinting attacks. The Nonce is the seed used for the random number generator that fills
       the table.
*** TODO Static Size
    The static size chunker will always may the chunks the same, configurable, size
*** TODO Disk Image Chunker
    The disk image chunker will understand disk image formats, and chunk them in an intelligent way.
**** TODO Raw Image Chunker
     The raw image chunker will attempt to detect raw disk images (e.g. iso, img, etc..) and put any
     metadata in its own chunks, and then attempt to make the chunk size match up with the block
     size of the image.
**** TODO VMA Chunker
     This chunker should understand the Proxmox VMA format and be able to chunk it intelligently to
     maximize dedeuplication.
* Development Process
  As it is only me developing at the moment, the current development model isn't very structured. In
  the future it will consist of a branch-per-featured model with branches being required to past a
  minimum set of tests before being merged into master.
** Roadmap
*** 0.1.0 
    Release 0.1.0 should be a somewhat usable product. It will still only operate in append only
    mode, but will have support for an array of encryption, compression, and HMAC algorithm
    types. It will additionally have a tentatively stabilized on-disk format. The repository should
    be able to verify itself as a dedicated operation. The filesystem target should handle sparse
    data correctly.
**** TODO libasuran
     libasuran 0.1.0 should have the following features:

     - [ ] Somewhat stable on disk format
     - [ ] Support for zlib, lzma, and lz4 compression
     - [ ] Support for chacha20-poly1305 encryption
     - [ ] Should have cargo benchmarks
     - [ ] Should have a working sparse data API
     - [ ] Should have a method for verifiying the integreity of the repo
**** TODO asuran
     asuran 0.1.0 should have the following features:

     - [ ] Support for setting compression type/level
     - [ ] Support for setting encryption type
     - [ ] Support for setting HMAC algorithm
     - [ ] Runtime tests/benchmarks
     - [ ] Repository verification command
*** 0.2.0
