README.org
* Inspiration/Motivation
  This project is inspired by both [[https://borgbackup.readthedocs.io/en/stable/][Borg]] and [[https://restic.net/][Restic]]. Both are very good pieces of software, and
  perfectly suitable for many use cases, but my use case seems to lie in between the two.

  In many ways, this project is intended to be a mashup of what I consider to be the best features
  of the two applications, while attempting to make a modifiable and extendable framework that can
  be embedded in other applications easily. 
** Features Borg has that Restic is missing
   - Performance
     Borg generally has way better performance than Restic, in my work load I have personally found
     this to be to a disturbing extent.
   - Optional/Switchable Encryption
     Don't get me wrong, being able to safely store sensitive data on untrusted storage is really
     nice, but sometimes you really are backing up to trusted storage (e.g. an external hard drive
     that is already encrypted at the file system or drive level), and double encryption is just
     extra overhead.
   - Optional/Switchable Compression
     Restic doesn't support compression at all, which, in my opinion, makes it a no-go for many
     workloads
** Features Restic has that Borg is missing
   - Switchable Storage Backends
     This one is a big deal for me. As a home gamer, being able to directly backup my datahoarder
     levels of files to an unlimited GDrive or the like is a huge deal. This is also the /only/
     reason I use Restic for some of my backups
   - Multiple computers writing to the same repository
     Borg's repository locking and chunk cache mechanisms make writing to the same repository with
     multiple computers a huge pain in the ass. Not having all your computers backing up to the same
     repository decreases deduplication by an extremely large factor and is just generally not good.
** Features I want that neither has
   - Tar import and export
     This isn't entirely true, borg has tar export and is working on tar import, but it lacks one
     feature that is critical to my workflow, reproducing the same tar file. My work flow involves a
     program that produces backups as tar files, and when restoring them looks for a special file
     that must be the first in the tar. I would like the ability to import and export tars and keep
     the metadata of the tar the same, while still being able to take the tar apart and deduplciate
     the individual files within it, and use the compression defined by the repository.
   - Good multithreading
     While borg is python based and doesn't really used threads, restic has multithreading, but in
     my opinion, doesn't use it well
* Footnotes

[fn:4] The compression level used is also included in this tag, regardless of if it is needed or not.

[fn:3] A name can be any arbitrary string, and does not need to be unique.

[fn:2] Currently 250 segments per folder by default

[fn:1] Currently 250kB by default
